"Volume" = "Volum"; 
"Drawbars" = "Spaker"; 
"Percussion Level" = "Perkusjonsnivå"; 
"Percussion Time" = "Slagtid"; 
"Click" = "Klikk"; 
"Distortion" = "Forvrengning"; 
"Rotary Speaker" = "Roterende høyttaler"; 


